TSD_TK/src/Documents/Чек/Чек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Чек</name>
  <basedOn>Document.Чек</basedOn>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <attributes>
    <name>АдресEmailПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <comment>0 - продажа, 1 - возврат</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыДолгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыШирота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефонаПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетОРозничныхПродажах</name>
    <type>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеАдресаМестоположения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОплаты</name>
    <type>
      <types>EnumRef.СтатусыОплатыЧека</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЧека</name>
    <type>
      <types>EnumRef.СтатусыЧеков</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДСДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФискальныйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекПродажи</name>
    <type>
      <types>DocumentRef.Чек</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихкодЧека</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеобходимостьВводаАкцизнойМарки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеобходимостьШтрихкодаПриПродаже</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаценкаПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаценкаСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьСуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСУчетомСкидки</name>
      <comment>Заполняется только при возврате товаров. Идентифицирует позицию чека продажи.</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оплаты</name>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>CatalogRef.ВидыОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОплаты</name>
      <type>
        <types>EnumRef.ТипыОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АкцизныеМарки</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодАкцизнойМарки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>68</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОперацииПлатежнойСистемы</name>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>EnumRef.ВидыОперацийПлатежнойСистемы</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодАвторизации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКарты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>24</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСсылкиОперации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СлипЧек</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОперации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TSD_TK/src/Enums/СтатусыЧеков/СтатусыЧеков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЧеков</name>
  <enumValues>
    <name>Отложен</name>
  </enumValues>
  <enumValues>
    <name>Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>Пробит</name>
  </enumValues>
  <enumValues>
    <name>Архивный</name>
  </enumValues>
</mdclass:Enum>

TSD_TK/src/Enums/ВидыДвиженияДС/ВидыДвиженияДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДвиженияДС</name>
  <enumValues>
    <name>Внесение</name>
  </enumValues>
  <enumValues>
    <name>Изъятие</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
</mdclass:Enum>

TSD_TK/src/Enums/ТипыОплаты/ТипыОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОплаты</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>ПлатежнаяКарта</name>
  </enumValues>
</mdclass:Enum>

TSD_TK/src/Documents/Чек/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = ПолучитьПредставлениеЧека(Данные.Ссылка);
	
КонецПроцедуры

Функция ПолучитьПредставлениеЧека(СсылкаНаЧек) Экспорт
	
	ТекстЗаголовка = НСтр("ru = '%ПредставлениеНомера% от %ПредставлениеДата% (%СтатусЧека%)'");
	
	ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%ПредставлениеНомера%", 
		ОбщегоНазначенияКлиентСервер.ПредставлениеНомера(СсылкаНаЧек.Номер));
		
	ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%ПредставлениеДата%",
		Формат(СсылкаНаЧек.Дата,"ДФ=dd.MM; ДЛФ=D"));
	
	Если СсылкаНаЧек.СтатусЧека = Перечисления.СтатусыЧеков.Отложен 
		И ЗначениеЗаполнено(СсылкаНаЧек.СтатусОплаты) Тогда
		
		СтатусЧека = СсылкаНаЧек.СтатусОплаты;
	Иначе
		СтатусЧека = СсылкаНаЧек.СтатусЧека;
	КонецЕсли;
	
	ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%СтатусЧека%", СтатусЧека);
	
	Возврат ТекстЗаголовка;
	
КонецФункции

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЧекОплаты.Ссылка.Дата КАК Период,
	|	ЧекОплаты.Ссылка.КассоваяСмена КАК КассоваяСмена,
	|	ВЫБОР
	|		КОГДА ЧекОплаты.Ссылка.ВидОперации = 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ЧекОплаты.ТипОплаты КАК ТипОплаты,
	|	ВЫБОР
	|		КОГДА ЧекОплаты.Ссылка.ВидОперации = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияДС.Продажа)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияДС.Возврат)
	|	КОНЕЦ КАК ВидДвиженияДС,
	|	ЧекОплаты.Сумма КАК Сумма
	|ИЗ
	|	Документ.Чек.Оплаты КАК ЧекОплаты
	|ГДЕ
	|	ЧекОплаты.Ссылка = &Ссылка
	|	И ЧекОплаты.Ссылка.СтатусЧека В (ЗНАЧЕНИЕ(Перечисление.СтатусыЧеков.Пробит), ЗНАЧЕНИЕ(Перечисление.СтатусыЧеков.Архивный))";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Результат = Запрос.ВыполнитьПакет();
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредства", Результат[0].Выгрузить());
	
КонецПроцедуры

// Возвращает список чеков, которые содержат переданную номенклатуру
// 
// Возвращаемое значение:
//   Массив   - пустой массив, если чеков с номенклатурой нет.
//
Функция СписокЧековСодержащихНоменклатуру(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЧекТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Чек.Товары КАК ЧекТовары
		|ГДЕ
		|	ЧекТовары.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивЧеков = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивЧеков;
	
КонецФункции

Функция ДанныеОплатыПоПлатежнойКарте(ДокументСсылка) Экспорт
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ТипОплаты", Перечисления.ТипыОплаты.ПлатежнаяКарта);
	
	НайденнаяОплата = ДокументСсылка.Оплаты.НайтиСтроки(ПараметрыОтбора);
	
	Если НЕ НайденнаяОплата.Количество() = 0 Тогда
		
		Оплата = НайденнаяОплата[0];
		КлючСвязи = Оплата.КлючСвязи;
		
		Операция = ДокументСсылка.ОперацииПлатежнойСистемы.Найти(КлючСвязи, "КлючСвязи");
		
		ДанныеОплаты = Новый Структура;
		ДанныеОплаты.Вставить("ВидОплаты",           Оплата.ВидОплаты);
		ДанныеОплаты.Вставить("Сумма",               Оплата.Сумма);
		ДанныеОплаты.Вставить("ТипОплаты",           Оплата.ТипОплаты);
		ДанныеОплаты.Вставить("КодАвторизации",      Неопределено);
		ДанныеОплаты.Вставить("НомерКарты",          Неопределено);
		ДанныеОплаты.Вставить("НомерСсылкиОперации", Неопределено);
		ДанныеОплаты.Вставить("ДатаОперации",        Неопределено);
		ДанныеОплаты.Вставить("СлипЧек",             Неопределено);
		
		Если НЕ Операция = Неопределено Тогда
			ДанныеОплаты.КодАвторизации      = Операция.КодАвторизации;
			ДанныеОплаты.НомерКарты          = Операция.НомерКарты;
			ДанныеОплаты.НомерСсылкиОперации = Операция.НомерСсылкиОперации;
			ДанныеОплаты.ДатаОперации        = Операция.ДатаОперации;
			ДанныеОплаты.СлипЧек             = Операция.СлипЧек.Получить();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеОплаты;
	
КонецФункции

Функция ПолучитьОперацииПлатежнойСистемы(ДокументСсылка) Экспорт
	
	МассивДанных = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекОперацииПлатежнойСистемы.ВидОперации,
		|	ЧекОперацииПлатежнойСистемы.КлючСвязи,
		|	ЧекОперацииПлатежнойСистемы.КодАвторизации,
		|	ЧекОперацииПлатежнойСистемы.НомерКарты,
		|	ЧекОперацииПлатежнойСистемы.НомерСсылкиОперации,
		|	ЧекОперацииПлатежнойСистемы.СлипЧек,
		|	ЧекОперацииПлатежнойСистемы.ДатаОперации КАК ДатаОперации
		|ИЗ
		|	Документ.Чек.ОперацииПлатежнойСистемы КАК ЧекОперацииПлатежнойСистемы
		|ГДЕ
		|	ЧекОперацииПлатежнойСистемы.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОперации";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеОперации = Новый Структура;
		ДанныеОперации.Вставить("ВидОперации",         Выборка.ВидОперации);
		ДанныеОперации.Вставить("КодАвторизации",      Выборка.КодАвторизации);
		ДанныеОперации.Вставить("НомерКарты",          Выборка.НомерКарты);
		ДанныеОперации.Вставить("НомерСсылкиОперации", Выборка.НомерСсылкиОперации);
		ДанныеОперации.Вставить("СлипЧек",             Выборка.СлипЧек.Получить());
		ДанныеОперации.Вставить("ДатаОперации",        Выборка.ДатаОперации);
		
		МассивДанных.Добавить(ДанныеОперации);
	КонецЦикла;
		
	Возврат МассивДанных;
	
КонецФункции

#КонецОбласти

#КонецЕсли
